{
  "ashe": {
    "name": "Ashe",
    "role": "Damage",
    "difficulty": 2,
    "description": "Ashe quickly fires her rifle from the hip or uses her weapon’s aim-down sights to line up a high damage shot. She blasts enemies by throwing dynamite, and her coach gun packs enough punch to put some distance between her and her foes. And Ashe is not alone, as she can call on her omnic ally Bob, to join the fray when the need arises. ",
    "abilities": [
      {
        "name": "The Viper",
        "description": "Ashe's semi-automatic rifle fires quick shots, or she can use her aim-down sights for a more damaging, precise shot.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/ashe/ability-the-viper/icon-ability.png"
      },
      {
        "name": "Dynamite",
        "description": "Ashe throws an explosive that detonates after a short delay or immediately when shot. The explosion from Dynamite also lights enemies on fire, dealing damage over time.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/ashe/ability-dynamite/icon-ability.png"
      },
      {
        "name": "Coach Gun",
        "description": "Ashe blasts enemies in front of her, knocking them away and propelling herself backward for added mobility.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/ashe/ability-coach-gun/icon-ability.png"
      },
      {
        "name": "B.O.B.",
        "description": "Ashe summons her trusted omnic sidekick, Bob, who charges forward and knocks enemies into the air, then lays down suppressing fire with his arm cannons.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/ashe/ability-b.o.b./icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Elizabeth Caledonia “Calamity” Ashe",
        "age": "39",
        "occupation": "Thief, Gang Leader",
        "baseOfOperations": "Deadlock Gorge, Arizona, USA",
        "affiliation": "Deadlock Gang"
      },
      "catchPhrase": "My business, my rules.",
      "backStory": "Ashe is the ambitious and calculating leader of the Deadlock Gang and a respected figure in the criminal underworld. Born into a wealthy family, Ashe grew up surrounded by privilege. Her parents were highly sought-after business consultants and coaches for powerful CEOs around the world. Though her parents paid little attention to her (mostly leaving her in the care of the family’s omnic butler, Bob), they ensured that Ashe had every opportunity to succeed. But a chance meeting with a local ruffian, named Jesse McCree, and an impromptu string of crimes committed together opened her eyes to her true calling. The satisfaction of outwitting her targets and the thrill of getting away with it set her on the outlaw path. Along with the other three founders of the Deadlock Gang, Ashe started to make a name for herself with bigger and more extravagant heists. The Deadlock Gang’s rapid rise to prominence put them at odds with the other criminal organizations in the American Southwest; the encounters often became violent. After years of skirmishes and bloodshed, Ashe called the heads of the major groups together. Ashe saw the potential to grow the influence of all. She used what she’d learned from her parents’ business to bring order to these groups. Her proposal was that the gangs could work together (or at least, not work against each other). Her principles: keep your word, don’t work with the law, respect each other’s territory, and always punish betrayal. No longer having to focus her energies on squabbles with the other gangs, Ashe is now writing her name across the American Southwest with a string of audacious heists and operations that has put her at top of the authorities’ most-wanted lists and cemented her legacy as an outlaw legend."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/ashe/hero-select-portrait.png"
  },
  "moira": {
    "name": "Moira",
    "role": "Support",
    "difficulty": 2,
    "description": "Moira’s biotic abilities enable her to contribute healing or damage in any crisis. While Biotic Grasp gives Moira short-range options, her Biotic Orbs contribute longer-range, hands-off damage and healing; she can also Fade to escape groups or remain close to allies in need of support. Once she’s charged Coalescence, Moira can save multiple allies from elimination at once or finish off weakened enemies.",
    "abilities": [
      {
        "name": "Biotic Grasp",
        "description": "Using her left hand, Moira expends biotic energy to heal allies in front of her. Her right hand fires a long-range beam weapon that saps enemies’ health, healing Moira and replenishing her biotic energy.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/moira/ability-biotic-grasp/icon-ability.png"
      },
      {
        "name": "Biotic Orb",
        "description": "Moira launches a rebounding biotic sphere; she can choose between a regeneration effect that heals the allies it passes through, or a decay effect that deals damage to enemies. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/moira/ability-biotic-orb/icon-ability.png"
      },
      {
        "name": "Fade",
        "description": "Moira quickly teleports a short distance.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/moira/ability-fade/icon-ability.png"
      },
      {
        "name": "Coalescence",
        "description": "Moira channels a long-range beam that both heals allies and bypasses barriers to damage her enemies.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/moira/ability-coalescence/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Moira O’Deorain",
        "age": "48",
        "occupation": "Geneticist",
        "baseOfOperations": "Dublin, Ireland; Oasis, Iraq",
        "affiliation": "Talon; Blackwatch (formerly)"
      },
      "catchPhrase": "Science will reveal the truth.",
      "backStory": "Equal parts brilliant and controversial, scientist Moira O'Deorain is on the cutting edge of genetic engineering, searching for a way to rewrite the fundamental building blocks of life. Over a decade ago, O'Deorain made waves when she published a controversial paper detailing a methodology for creating custom genetic programs that could alter DNA at a cellular level. It seemed like a promising step toward overcoming diseases and disorders and maximizing human potential.  Dissent among her peers soon followed. Many considered her work to be dangerous because of its perceived ethical shortfalls, and O'Deorain was even accused of having the same unchecked desire for scientific advancement that some believed had caused the Omnic Crisis. In addition, other geneticists were unable to reproduce the results of Moira's research, which further called her discoveries into question. Instead of kickstarting her career, her paper seriously damaged her reputation. She received a lifeline in an offer from an unlikely source: Overwatch's covert ops division, Blackwatch. She continued her work in the shadows while developing new weapons and technologies for the organization. Her employment was a closely kept secret, until it was uncovered during inquiries following the Venice incident. Many high-ranking Overwatch officials disavowed all knowledge of her affiliation with them. After Overwatch was disbanded, O'Deorain was forced to turn to unconventional sources of funding. This time, she was invited to join the scientific collective that had founded the city of Oasis. Yet some have whispered that the shadowy Talon organization had already been supporting her for years, aiding her experiments in exchange for utilizing the results for their own purposes. Though O'Deorain will go to any lengths to make scientific breakthroughs, her work is still unknown to most of the world. But now that she has been freed from all constraints, it is only a matter of time before everything changes."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/moira/hero-select-portrait.png"
  },
  "soldier-76": {
    "name": "Soldier: 76",
    "role": "Damage",
    "difficulty": 1,
    "description": "Armed with cutting-edge weaponry, including an experimental pulse rifle that’s capable of firing spirals of high-powered Helix Rockets, Soldier: 76 has the speed and support know-how of a highly trained warrior.",
    "abilities": [
      {
        "name": "Heavy Pulse Rifle",
        "description": "Soldier: 76’s rifle remains particularly steady while unloading fully-automatic pulse fire.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/soldier:-76/ability-heavy-pulse-rifle/icon-ability.png"
      },
      {
        "name": "Helix Rockets",
        "description": "Tiny rockets spiral out of Soldier: 76’s Pulse Rifle in a single burst. The rockets’ explosion damages enemies in a small radius.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/soldier:-76/ability-helix-rockets/icon-ability.png"
      },
      {
        "name": "Sprint",
        "description": "Whether he needs to evade a firefight or get back into one, Soldier: 76 can rush ahead in a burst of speed. His sprint ends if he takes an action other than charging forward.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/soldier:-76/ability-sprint/icon-ability.png"
      },
      {
        "name": "Biotic Field",
        "description": "Soldier: 76 plants a biotic emitter on the ground. Its energy projection restores health to 76 and any of his squadmates within the field.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/soldier:-76/ability-biotic-field/icon-ability.png"
      },
      {
        "name": "Tactical Visor",
        "description": "Soldier: 76’s pinpoint targeting visor “locks” his aim on the threat closest to his crosshairs. If an enemy leaves his line of sight, Soldier: 76 can quickly switch to another target.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/soldier:-76/ability-tactical-visor/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Unknown",
        "age": "Unknown",
        "occupation": "Vigilante",
        "baseOfOperations": "Unknown",
        "affiliation": "Overwatch (formerly)"
      },
      "catchPhrase": "We're all soldiers now.",
      "backStory": "Currently the target of an international manhunt, the vigilante known as Soldier: 76 wages a personal war to expose the truth behind Overwatch's collapse. Soldier: 76 revealed himself in a string of attacks that crisscrossed the globe, targeting financial institutions, shadowy corporations, and secure Overwatch facilities. Though to the outside world his motives are inscrutable, there are those who claim that he is a former Overwatch agent, determined to shed light on the conspiracy that brought down the organization. While his true identity remains a mystery, he is believed to have been trained as a member of the American \"soldier enhancement program.\" He possesses physical capabilities exceeding those of a conventional soldier's, as well as other augmentations that make him a peerless combatant. In addition, he utilizes a cutting-edge arsenal, much of it stolen in raids on Overwatch installations. Unrelenting in his search to find those responsible for Overwatch's fall, Soldier: 76 will stop at nothing to bring them to justice."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/soldier:-76/hero-select-portrait.png"
  },
  "mccree": {
    "name": "McCree",
    "role": "Damage",
    "difficulty": 2,
    "description": "Armed with his Peacekeeper revolver, McCree takes out targets with deadeye precision and dives out of danger with eagle-like speed.",
    "abilities": [
      {
        "name": "Peacekeeper",
        "description": "McCree fires off a round from his trusty six-shooter. He can fan the Peacekeeper’s hammer to swiftly unload the entire cylinder.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mccree/ability-peacekeeper/icon-ability.png"
      },
      {
        "name": "Combat Roll",
        "description": "McCree dives in the direction he’s moving, effortlessly reloading his Peacekeeper in the process.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mccree/ability-combat-roll/icon-ability.png"
      },
      {
        "name": "Flashbang",
        "description": "McCree heaves a blinding grenade that explodes shortly after it leaves his hand. The blast staggers enemies in a small radius.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mccree/ability-flashbang/icon-ability.png"
      },
      {
        "name": "Deadeye",
        "description": "Focus. Mark. Draw. McCree takes a few precious moments to aim; when he’s ready to fire, he shoots every enemy in his line of sight. The weaker his targets are, the faster he’ll line up a killshot.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mccree/ability-deadeye/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Jesse McCree",
        "age": "37",
        "occupation": "Bounty Hunter",
        "baseOfOperations": "Santa Fe, New Mexico, USA",
        "affiliation": "Overwatch (formerly)"
      },
      "catchPhrase": "Justice ain't gonna dispense itself.",
      "backStory": "Armed with his Peacekeeper revolver, the outlaw Jesse McCree doles out justice on his own terms. McCree had already made a name for himself as a member of the notorious Deadlock Gang, which trafficked in illicit weapons and military hardware throughout the American Southwest, when he and his associates were busted in an Overwatch sting operation. With his expert marksmanship and resourcefulness, he was given the choice between rotting in a maximum-security lockup and joining Blackwatch, Overwatch's covert ops division. He chose the latter. Although he was initially cynical, he came to believe that he could make amends for his past sins by righting the injustices of the world. McCree appreciated the flexibility afforded to the clandestine Blackwatch, unhindered by bureaucracy and red tape. But as Overwatch's influence waned, rogue elements within Blackwatch sought to bring down the organization and turn it to their own ends. Wanting no part of the infighting, McCree set off alone and went underground. He resurfaced several years later as a gunslinger for hire. But while McCree's talents are sought after by parties great and small, he fights only for causes he believes are just."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/mccree/hero-select-portrait.png"
  },
  "lucio": {
    "name": "Lúcio",
    "role": "Support",
    "difficulty": 2,
    "description": "On the battlefield, Lúcio’s cutting-edge Sonic Amplifier buffets enemies with projectiles and knocks foes back with blasts of sound. His songs can both heal his team or boost their movement speed, and he can switch between tracks on the fly.",
    "abilities": [
      {
        "name": "Sonic Amplifier",
        "description": "Lúcio can hit his enemies with sonic projectiles or knock them back with a blast of sound.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/lúcio/ability-sonic-amplifier/icon-ability.png"
      },
      {
        "name": "Crossfade",
        "description": "Lúcio continuously energizes himself—and nearby teammates—with music. He can switch between two songs: one amplifies movement speed, while the other regenerates health.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/lúcio/ability-crossfade/icon-ability.png"
      },
      {
        "name": "Amp It Up",
        "description": "Lúcio increases the volume on his speakers, boosting the effects of his songs.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/lúcio/ability-amp-it-up/icon-ability.png"
      },
      {
        "name": "Sound Barrier",
        "description": "Protective  waves radiate  out from Lúcio’s Sonic Amplifier, briefly providing him and nearby allies with personal shields.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/lúcio/ability-sound-barrier/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Lúcio Correia dos Santos",
        "age": "26",
        "occupation": "DJ, Freedom Fighter",
        "baseOfOperations": "Rio de Janeiro, Brazil",
        "affiliation": "None"
      },
      "catchPhrase": "Come on, let’s bring it together!",
      "backStory": "Lúcio is an international celebrity who inspires social change through his music and actions. Lúcio Correia dos Santos grew up in Rio de Janeiro, in a poor and crowded favela that was hit hard by the financial upheaval following the Omnic Crisis. As Brazil began the long process of recovery, he wanted to find a way to lift the spirits of those around him. He found his answer in music and its power to bring people together and even help them forget their troubles, if only for a short time. He performed on street corners, in block parties, and as he got older, at a string of legendary underground shows. But Lúcio's close-knit community was thrown into chaos when the multinational Vishkar Corporation secured a contract to redevelop large tracts of the city. Lúcio and his neighbors had been told that the development would improve their lives. However, that promise never became a reality. Vishkar imposed controls on the residents in the name of building a more orderly society: enforcing curfews, cracking down on what the company perceived as lawless behavior, and exploiting the populace as a cheap labor force. Lúcio wouldn't stand for it. He stole Vishkar sonic technology that had been used to suppress the people, and he converted it into a tool to rally them to action. In a popular uprising, they drove Vishkar out of their neighborhoods. Lúcio's leadership made him a star overnight and a symbol for positive social change. His music skyrocketed in popularity. Whereas he had once performed locally, he was now filling arenas across the world. With his newfound fame, Lúcio realizes that he has an opportunity to make a difference and change the world for the better."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/lúcio/hero-select-portrait.png"
  },
  "brigitte": {
    "name": "Brigitte",
    "role": "Support",
    "difficulty": 1,
    "description": "Brigitte specializes in armor. She can throw Repair Packs to heal teammates, or automatically heal nearby allies when she damages foes with her Flail. Her Flail is capable of a wide swing to strike multiple targets, or a Whip Shot that stuns an enemy at range. When entering the fray, Barrier Shield provides personal defense while she attacks enemies with Shield Bash. Brigitte’s ultimate ability, Rally, gives her a substantial short-term boost of speed and provides long-lasting armor to all her nearby allies. ",
    "abilities": [
      {
        "name": "Rocket Flail",
        "description": "Brigitte's melee weapon has an extended range, enabling her to strike multiple enemies with a single swing.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/brigitte/ability-rocket-flail/icon-ability.png"
      },
      {
        "name": "Repair Pack",
        "description": "Brigitte throws a Repair Pack that can heal an ally. Any healing over that ally’s maximum health provides them with armor instead.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/brigitte/ability-repair-pack/icon-ability.png"
      },
      {
        "name": "Whip Shot",
        "description": "Brigitte throws her flail a long distance, dealing damage and knocking an enemy away from her.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/brigitte/ability-whip-shot/icon-ability.png"
      },
      {
        "name": "Barrier Shield",
        "description": "Brigitte deploys a frontal energy barrier to absorb a limited amount of damage. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/brigitte/ability-barrier-shield/icon-ability.png"
      },
      {
        "name": "Shield Bash",
        "description": "Once her Barrier Shield is deployed, Brigitte can dash forward to stun an enemy.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/brigitte/ability-shield-bash/icon-ability.png"
      },
      {
        "name": "Rally",
        "description": "Brigitte moves faster and provides all nearby allies with armor that lasts until it’s removed by damage. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/brigitte/ability-rally/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Brigitte Lindholm",
        "age": "23",
        "occupation": "Mechanical Engineer, Adventurer",
        "baseOfOperations": "Gothenburg, Sweden (formerly)",
        "affiliation": "None"
      },
      "catchPhrase": "I will prove myself!",
      "backStory": "No longer sitting on the sidelines, Brigitte Lindholm has taken up arms to defend those in need of protection. The youngest daughter of weapons designer, Torbjörn Lindholm, Brigitte was the first of his children to show an interest in mechanical engineering. Brigitte spent much of her spare time in her father's workshop, learning the trade and honing her skills. Her aptitude for engineering mirrored that of her father's, but Brigitte's primary interest was in armor fabrication and defensive systems, unlike Torbjörn, who was world renowned (and perhaps infamous) for the weapons he created. Everyone expected that Brigitte would continue her apprenticeship and follow in her father's footsteps. But her plans changed due to influence of another prominent figure in her life, her father's close friend and fellow Overwatch agent, Reinhardt Wilhelm. A close friend of the family and Brigitte's godfather, Reinhardt told Brigitte tales of heroes and chivalry as she grew up. After his retirement and Overwatch's fall, Reinhardt declared that he would become a knight-errant on a quest to bring justice. Before he left on his adventures, Brigitte surprised him by asking to join him as his squire. Reinhardt accepted.  As a squire, Brigitte had many responsibilities, the most important of which was the upkeep of Reinhardt's Crusader armor (a design she was familiar with as the current version was designed by her father). But more and more, she found her main job was taking care of Reinhardt himself, trying to protect him from his overenthusiasm even as his body was breaking down from years of combat.  Eventually, she realized that serving only as a mechanic wasn't enough, and that the best way she could aid Reinhardt was to become a warrior in her own right. While Reinhardt trained her in combat, Brigitte began to build her own suit of armor in secret.  Now Brigitte fights at Reinhardt's side to protect him, and any others in need as knight and squire journey to make the world a better place, one battle at a time."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/brigitte/hero-select-portrait.png"
  },
  "echo": {
    "name": "Echo",
    "role": "Damage",
    "difficulty": 2,
    "description": "Echo is an evolutionary robot programmed with a rapidly adapting artificial intelligence, versatile enough to fill multiple battlefield combat roles.",
    "abilities": [
      {
        "name": "Tri-Shot",
        "description": "Echo fires 3 shots at once, in a triangle pattern.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/echo/ability-tri-shot/icon-ability.png"
      },
      {
        "name": "Sticky Bombs",
        "description": "Echo fires a volley of sticky bombs that detonates after a delay.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/echo/ability-sticky-bombs/icon-ability.png"
      },
      {
        "name": "Flight",
        "description": "Echo surges forward quickly, then can fly freely.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/echo/ability-flight/icon-ability.png"
      },
      {
        "name": "Focusing Beam",
        "description": "Echo channels a beam for a few seconds, dealing very high damage to targets with less than half health.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/echo/ability-focusing-beam/icon-ability.png"
      },
      {
        "name": "Glide",
        "description": "Echo can glide while falling.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/echo/ability-glide/icon-ability.png"
      },
      {
        "name": "Duplicate",
        "description": "Echo duplicates a targeted enemy hero and gains use of their abilities.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/echo/ability-duplicate/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Echo",
        "age": "Classified",
        "occupation": "Multirole Adaptive Robot",
        "baseOfOperations": "Switzerland (formerly)",
        "affiliation": "Overwatch"
      },
      "catchPhrase": "It’s good to be back.",
      "backStory": "To chart the origins of the Echo project, it is important to delve into the personal history of Singaporean scientist Dr. Mina Liao, who would later become perhaps best known as one of the founding members of Overwatch. But prior to joining the organization, Dr. Liao was widely considered one of the preeminent experts in the fields of robotics and artificial intelligence, and an employee of Omnica Corporation. There she worked on the team that was responsible for the design and creation of the omnics that would ultimately wage war against humanity during the Omnic Crisis. Ultimately, it was this expertise that led her to be recruited into Overwatch to help stop her creations.  Even that catastrophe was not enough to dissuade Liao of her firmly held belief in the potential artificial life and its power to transform the lives of humanity for the better. She dreamed of improving upon the original omnic designs. These theories would become the foundation of the Echo project. However, due to Overwatch’s restrictions on artificial intelligence research and development after the Omnic Crisis, Liao was forced to limit Echo’s capabilities. What she created was a multirole, adaptive robot that could be programmed to learn different functions: anything from medical support to construction: but had serious limits to its independent decision making. Critically, Echo had multiple layers of protections, failsafes, and security to keep it under control. Echo was used successfully on test missions alongside Overwatch strike teams, but Overwatch leadership was reluctant to put it into full service. However, the truth was that Liao had programmed Echo with a powerful, general artificial intelligence that learned by observation. After thousands of hours in the scientist’s presence, much of Liao’s behaviors (including her speech), were adopted by the Echo robot. This secret that was known by very few, including Blackwatch agent Jesse McCree, who had, at times, been assigned to guard the scientist. When Liao was killed in attack on an Overwatch facility, Overwatch’s leadership was reluctant to continue pursuing such a dangerous project, and all development on Echo was shut down, and the robot was placed into quarantine. Having joined up with the new Overwatch team to defend Paris against the Null Sector incursion, for the first time, Echo is seeing action as a full-fledged team member. But as she is exposed to new people, new ideas, and new situations without Dr. Liao to guide her, no one knows how she might evolve in the future."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/echo/hero-select-portrait.png"
  },
  "reaper": {
    "name": "Reaper",
    "role": "Damage",
    "difficulty": 1,
    "description": "Hellfire Shotguns, the ghostly ability to become immune to damage, and the power to step between shadows make Reaper one of the deadliest beings on Earth.",
    "abilities": [
      {
        "name": "Hellfire Shotguns",
        "description": "Reaper tears enemies apart with twin shotguns.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/reaper/ability-hellfire-shotguns/icon-ability.png"
      },
      {
        "name": "Wraith Form",
        "description": "Reaper becomes a shadow for a short period of time. While in this form, he takes no damage and is able to pass through enemies, but cannot fire his weapons or use other abilities.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/reaper/ability-wraith-form/icon-ability.png"
      },
      {
        "name": "Shadow Step",
        "description": "After marking a destination, Reaper disappears and reappears at that location.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/reaper/ability-shadow-step/icon-ability.png"
      },
      {
        "name": "Death Blossom",
        "description": "In a blur of motion, Reaper empties both Hellfire Shotguns at breakneck speed, dealing massive damage to all nearby enemies.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/reaper/ability-death-blossom/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Unknown",
        "age": "Unknown",
        "occupation": "Mercenary",
        "baseOfOperations": "Unknown",
        "affiliation": "Unknown"
      },
      "catchPhrase": "Death walks among you.",
      "backStory": "Some speak of a black-robed terrorist known only as the Reaper. His identity and motives are a mystery. What is known is that where he appears, death follows. The Reaper is an extremely volatile mercenary, a ruthless and remorseless killer responsible for terrorist attacks across the world. He has fought in many armed conflicts in the last decades, showing no loyalty to any cause or organization. Survivors have described a black shadow ghosting unscathed through the most hellish battlefields. The few bodies recovered of those he kills are pale, empty husks drained of life, their cells showing signs of intense degradation. It is possible that he is a byproduct of failed genetic alteration which forces his cells to simultaneously decay and regenerate at a hyper-accelerated rate. Those attempting to track his movements have begun to see a pattern in his appearances. They believe that Reaper is hunting former Overwatch agents and systematically eliminating them."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/reaper/hero-select-portrait.png"
  },
  "reinhardt": {
    "name": "Reinhardt",
    "role": "Tank",
    "difficulty": 1,
    "description": "Clad in powered armor and swinging his hammer, Reinhardt leads a rocket-propelled charge across the battleground and defends his squadmates with a massive energy barrier.",
    "abilities": [
      {
        "name": "Rocket Hammer",
        "description": "Reinhardt’s Rocket Hammer is an exemplary melee weapon, able to deal punishing damage in a wide arc with every swing.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/reinhardt/ability-rocket-hammer/icon-ability.png"
      },
      {
        "name": "Barrier Field",
        "description": "Reinhardt projects a broad, forward-facing energy barrier, which can absorb substantial damage before it is destroyed. Though Reinhardt can protect himself and his companions behind the barrier, he cannot attack while sustaining it.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/reinhardt/ability-barrier-field/icon-ability.png"
      },
      {
        "name": "Charge",
        "description": "Reinhardt charges forth in a straight line, pinning the first enemy in his path and knocking others aside. If he collides with a wall, the foe he’s carrying suffers extreme damage.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/reinhardt/ability-charge/icon-ability.png"
      },
      {
        "name": "Fire Strike",
        "description": "By whipping his Rocket Hammer forward, Reinhardt slings a flaming projectile which pierces and damages any enemies it touches.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/reinhardt/ability-fire-strike/icon-ability.png"
      },
      {
        "name": "Earthshatter",
        "description": "Reinhardt forcefully slams his Rocket Hammer into the ground, knocking down and damaging all enemies in front of him.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/reinhardt/ability-earthshatter/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Reinhardt Wilhelm",
        "age": "61",
        "occupation": "Adventurer",
        "baseOfOperations": "Stuttgart, Germany",
        "affiliation": "Overwatch (formerly)"
      },
      "catchPhrase": "Justice will be done.",
      "backStory": "Reinhardt Wilhelm styles himself as a champion of a bygone age, who lives by the knightly codes of valor, justice, and courage. Over thirty years ago, Overwatch was founded to counter the threat of the robot uprisings around the world. Reinhardt, a highly decorated German soldier, was inducted as part of the original Overwatch strike team that put an end to the Omnic Crisis. After the conflict's resolution, Overwatch grew into a global institution, keeping the peace in a war-torn world. Reinhardt proved himself to be one of its most stalwart champions. Reinhardt's unique ethics and larger-than-life persona earned the admiration of his peers and superiors alike. Never afraid to speak his mind, he was Overwatch's most vocal supporter and, when necessary, its harshest critic, providing a constant reminder that Overwatch was meant to be a force for good. Having served into his late fifties, Reinhardt was faced with mandatory retirement from combat operations. Despondent about being removed from active duty, Reinhardt feared that his days of purpose and glory had ended. As times grew darker and Overwatch came under suspicion of corruption and sedition, Reinhardt could only watch as the cause he had dedicated his life to defending surrendered in disgrace. Though Overwatch was eventually disbanded, Reinhardt was not content to sit idly by while the world fell to disorder. Once again donning his Crusader armor, he has vowed to fight for justice across Europe like a knight of old, defending the innocent and winning hearts and minds with the promise of better days to come."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/reinhardt/hero-select-portrait.png"
  },
  "symmetra": {
    "name": "Symmetra",
    "role": "Damage",
    "difficulty": 2,
    "description": "Symmetra utilizes her Photon Projector to dispatch adversaries, shield her associates, construct teleportation pads and deploy particle-blasting Sentry Turrets.",
    "abilities": [
      {
        "name": "Photon Projector",
        "description": "Symmetra’s weapon emits a ranged beam. It deals continuous damage that increases the longer it is connected. The projector can also release an explosive energy ball that deals high damage on contact.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/symmetra/ability-photon-projector/icon-ability.png"
      },
      {
        "name": "Sentry Turret",
        "description": "Symmetra launches a small turret that automatically fires speed-reducing blasts at the nearest enemy within range. Up to three turrets can be built on the battlefield at once.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/symmetra/ability-sentry-turret/icon-ability.png"
      },
      {
        "name": "Teleporter",
        "description": "Symmetra places a temporary teleporter exit pad at a distance and connects it to a teleporter entry pad at her current location. Allies (and some of their abilities, such as Junkrat’s RIP-Tire) can travel from the entry pad to the exit pad instantly. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/symmetra/ability-teleporter/icon-ability.png"
      },
      {
        "name": "Photon Barrier",
        "description": "Symmetra deploys a massive energy barrier which prevents ranged attacks and is big enough to cut through the entire map.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/symmetra/ability-photon-barrier/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Satya Vaswani",
        "age": "28",
        "occupation": "Architech",
        "baseOfOperations": "Utopaea, India",
        "affiliation": "Vishkar Corporation"
      },
      "catchPhrase": "The true enemy of humanity is disorder.",
      "backStory": "Symmetra literally bends reality. By manipulating hard-light constructs, she crafts the world as she wishes it to be, in hopes of engineering a perfect society. Following the Omnic Crisis, the Vishkar Corporation of southern India began the laborious process of creating new, self-sustaining cities to house the nation's displaced population. One such city, Utopaea, was created using radical hard-light technology that enabled its architechs to shape the city's streets, utilities, and living spaces in the blink of an eye. After she was identified as one of the few capable of becoming a light-bending architech, young Satya Vaswani was plucked from extreme poverty and placed in the care of Vishkar's architech academy, never to return home. Isolated and lonely in her new life, Satya immersed herself in her education and training. She quickly grasped the applications of the technology and was one of the top students in her class. Satya approached hard-light manipulation differently than her peers, with their more procedural, mechanical constructions, instead weaving her constructs in the motions of the traditional dance of her homeland. Though she was one of Utopaea's top architechs, the Vishkar Corporation saw far greater potential in Satya's abilities. Giving her the moniker \"Symmetra,\" Vishkar sent her on clandestine missions around the world to uphold its corporate interests and expand its influence into other countries. Symmetra believes her actions serve the greater good in society. But there are times when she wonders whether the control and order she desires are truly best for humanity."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/symmetra/hero-select-portrait.png"
  },
  "dva": {
    "name": "D.Va",
    "role": "Tank",
    "difficulty": 2,
    "description": "D.Va’s mech is nimble and powerful—its twin Fusion Cannons blast away with autofire at short range, and she can use its Boosters to barrel over enemies and obstacles, or deflect attacks with her projectile-dismantling Defense Matrix.",
    "abilities": [
      {
        "name": "Fusion Cannons",
        "description": "D.Va's mech is equipped with twin short-range rotating cannons. They lay down continuous, high-damage fire without needing to reload, but slow D.Va’s movement while they’re active.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/d.va/ability-fusion-cannons/icon-ability.png"
      },
      {
        "name": "Light Gun",
        "description": "While outside of her mech, D.Va can continue the fight with a mid-range automatic blaster.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/d.va/ability-light-gun/icon-ability.png"
      },
      {
        "name": "Boosters",
        "description": "D.Va’s mech launches into the air, her momentum carrying her forward. She can turn and change directions or barrel through her enemies, knocking them back.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/d.va/ability-boosters/icon-ability.png"
      },
      {
        "name": "Defense Matrix",
        "description": "D.Va can maintain this forward-facing targeting array for a short period of time; while active, it'll stop incoming projectiles.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/d.va/ability-defense-matrix/icon-ability.png"
      },
      {
        "name": "Micro Missiles",
        "description": "D.Va launches a volley of explosive rockets. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/d.va/ability-micro-missiles/icon-ability.png"
      },
      {
        "name": "Self-Destruct",
        "description": "D.Va ejects from her mech and sets its reactor to explode, dealing massive damage to nearby opponents.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/d.va/ability-self-destruct/icon-ability.png"
      },
      {
        "name": "Call Mech",
        "description": "If her armored battle suit is destroyed, D.Va can call down a fresh mech and return to the fray.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/d.va/ability-call-mech/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Hana Song",
        "age": "19",
        "occupation": "Pro Gamer (formerly), Mech Pilot",
        "baseOfOperations": "Busan, South Korea",
        "affiliation": "Mobile Exo-Force of the Korean Army"
      },
      "catchPhrase": "I play to win.",
      "backStory": "D.Va is a former professional gamer who now uses her skills to pilot a state-of-the-art mech in defense of her homeland. Twenty years ago, South Korea was attacked by a colossal omnic monstrosity that rose from the depths of the East China Sea. The massive, lumbering construct caused catastrophic damage to coastal cities before it was driven back beneath the waves. In response, the South Korean government developed a mechanized armored drone unit, called MEKA, to protect urban environments in future engagements with the omnic threat. The government's fears proved to be well founded, as a disturbing pattern of attacks emerged. Every few years, the monstrosity would rise from the sea to assault South Korea and its neighbors. The omnic learned from these encounters, often reconfiguring itself in a different form and appearing with new weapons and capabilities. Each incident ended in a stalemate, with the monstrosity defeated but not destroyed. As the omnic continued to adapt, it eventually disrupted MEKA's drone-control networks, forcing the military to place pilots in the mechs. Scrambling to find suitable candidates, the government turned to the country's professional gamers, who possessed the necessary reflexes and instincts to operate the mechs' advanced weapons systems. Top stars were drafted, including reigning world champion Hana Song, also known as \"D.Va.\" Famous for her elite skills, D.Va was a fierce competitor who played to win at all costs, and she had a well-earned reputation for showing no mercy to her opponents. Seeing her new mission as a game, D.Va fearlessly charges into battle alongside the rest of her MEKA unit, ready to spring to her nation's defense at a moment's notice. Recently, she has begun to stream combat operations to her adoring fans, and her growing following has turned her into a global icon."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/d.va/hero-select-portrait.png"
  },
  "mei": {
    "name": "Mei",
    "role": "Damage",
    "difficulty": 3,
    "description": "Mei’s weather-altering devices slow opponents and protect locations. Her Endothermic Blaster unleashes damaging icicles and frost streams, and she can Cryo-Freeze herself to guard against counterattacks, or obstruct the opposing team's movements with an Ice Wall.",
    "abilities": [
      {
        "name": "Endothermic Blaster",
        "description": "Mei’s blaster unleashes a concentrated, short-range stream of frost that damages, slows, and ultimately freezes enemies in place. Mei can also use her blaster to shoot icicle-like projectiles at medium range.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mei/ability-endothermic-blaster/icon-ability.png"
      },
      {
        "name": "Cryo-Freeze",
        "description": "Mei instantly surrounds herself with a block of thick ice. She heals and ignores damage while encased, but cannot move or use abilities.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mei/ability-cryo-freeze/icon-ability.png"
      },
      {
        "name": "Ice Wall",
        "description": "Mei generates an enormous ice wall that obstructs lines of sight, stops movement, and blocks attacks.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mei/ability-ice-wall/icon-ability.png"
      },
      {
        "name": "Blizzard",
        "description": "Mei deploys a weather-modification drone that emits gusts of wind and snow in a wide area. Enemies caught in the blizzard are slowed and take damage; those who linger too long are frozen solid.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mei/ability-blizzard/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Mei-Ling Zhou",
        "age": "31",
        "occupation": "Climatologist, Adventurer",
        "baseOfOperations": "Xi’an, China (formerly)",
        "affiliation": "Overwatch (formerly)"
      },
      "catchPhrase": "Our world is worth fighting for.",
      "backStory": "Mei is a scientist who has taken the fight to preserve the environment into her own hands. Though many blamed the planet's escalating, unexplained climate phenomena on the advent of new technologies, the rapidly growing omnic population, and drastically increased consumption of resources, the true cause remained unknown. To find a solution, Overwatch established a series of eco-Watchpoints at remote, critical locations worldwide. Mei-Ling Zhou was a member of this multiyear initiative. A peerless climatologist, she had introduced cutting-edge innovations in the field of climate manipulation that protected at-risk areas in Asia and beyond. She was assigned to the program's monitoring station at Watchpoint: Antarctica when disaster struck: a sudden, catastrophic polar storm battered the installation and cut it off from the outside world, leaving the facility damaged and the scientists stranded. As their supplies dwindled, they entered cryostasis in a last-ditch effort to survive until a rescue attempt could be made. But that rescue never came. It was years later when the team's cryogenics chamber was finally discovered. Mei, still in hibernation, was the only survivor. The world Mei awoke to had gone through considerable changes: Overwatch was no more, the serious climate issues had worsened, and none of the eco-Watchpoints were in operation. Any clues that they had uncovered were lost. Mei has decided to continue her work on her own. Equipped with a portable version of her climate-manipulation technology, she travels around the world, hoping to re-establish the eco-network and track down the causes of the threats to the planet's ecosystem."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/mei/hero-select-portrait.png"
  },
  "genji": {
    "name": "Genji",
    "role": "Damage",
    "difficulty": 3,
    "description": "Genji flings precise and deadly Shuriken at his targets, and uses his technologically-advanced katana to deflect projectiles or deliver a Swift Strike that cuts down enemies.",
    "abilities": [
      {
        "name": "Shuriken",
        "description": "Genji looses three deadly throwing stars in quick succession. Alternatively, he can throw three shuriken in a wider spread.\n",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/genji/ability-shuriken/icon-ability.png"
      },
      {
        "name": "Deflect",
        "description": "With lightning-quick swipes of his sword, Genji reflects an oncoming projectile and sends it rebounding towards his opponent.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/genji/ability-deflect/icon-ability.png"
      },
      {
        "name": "Swift Strike",
        "description": "Genji darts forward, slashing with his katana and passing through foes in his path. If Genji eliminates a target, he can instantly use this ability again.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/genji/ability-swift-strike/icon-ability.png"
      },
      {
        "name": "Dragonblade",
        "description": "Genji brandishes his katana for a brief period of time. Until he sheathes his sword, Genji can deliver killing strikes to any targets within his reach.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/genji/ability-dragonblade/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Genji Shimada",
        "age": "35",
        "occupation": "Adventurer",
        "baseOfOperations": "Shambali Monastery, Nepal",
        "affiliation": "Shimada Clan (formerly), Overwatch (formerly)"
      },
      "catchPhrase": "Even if I sacrifice my body, I will never sacrifice my honor.",
      "backStory": "The cyborg Genji Shimada has made peace with the augmented body he once rejected, and in doing so, he has discovered a higher humanity. As the youngest son of the master of the Shimada ninja clan, Genji lived a life of luxury and privilege. He had little interest in the family's illegal businesses, and although he excelled at and enjoyed his ninja training, he spent most of his time pursuing a playboy lifestyle. Many within the clan considered the carefree Genji to be a dangerous liability, and they resented his father for coddling and protecting him. Following the clan leader's untimely death, Genji's older brother, Hanzo, demanded that Genji take a more active role in their late father's empire. Genji refused, enraging Hanzo. The tension between the brothers built to a violent confrontation that left Genji on the verge of dying. Hanzo believed that he had killed his brother, but Genji was rescued by Overwatch and the intervention of Dr. Angela Ziegler. The global security force saw Genji as a potential asset in its ongoing operations to combat the Shimada clan. As Genji's injuries left him clinging to life, Overwatch offered to rebuild his body in exchange for his help. He was put through an extensive process of cyberization, which enhanced his natural speed and agility and augmented his superlative ninja skills. Transformed into a living weapon, Genji single-mindedly set about the task of dismantling his family's criminal empire. But as time passed, Genji felt increasingly at war with himself. He was repulsed by the mechanical parts of his body and could not come to grips with what he had become. When his mission was complete, he abandoned Overwatch and wandered the world in search of meaning. He drifted for many years before crossing paths with the omnic monk Zenyatta. Though Genji initially rejected Zenyatta's wisdom, the benevolent omnic would not be deterred. In time, Zenyatta became his mentor, and under the monk's tutelage, Genji reconciled his dual existence as both man and machine. He learned to accept that although he had a cyborg body, his human soul was intact, and he came to see his new form as a gift and a unique strength. Now, for the first time in his life, Genji is free. Even he cannot say where his path will ultimately lead."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/genji/hero-select-portrait.png"
  },
  "ana": {
    "name": "Ana",
    "role": "Support",
    "difficulty": 3,
    "description": "Ana’s versatile arsenal allows her to affect heroes all over the battlefield. Her Biotic Rifle rounds and Biotic Grenades heal allies and damage or impair enemies; her sidearm tranquilizes key targets, and Nano Boost gives one of her comrades a considerable increase in power.",
    "abilities": [
      {
        "name": "Biotic Rifle",
        "description": "Ana’s rifle shoots darts that can restore health to her allies or deal ongoing damage to her enemies. She can use the rifle’s scope to zoom in on targets and make highly accurate shots.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/ana/ability-biotic-rifle/icon-ability.png"
      },
      {
        "name": "Sleep Dart",
        "description": "Ana fires a dart from her sidearm, rendering an enemy unconscious (though any damage will rouse them).",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/ana/ability-sleep-dart/icon-ability.png"
      },
      {
        "name": "Biotic Grenade",
        "description": "Ana tosses a biotic bomb that deals damage to enemies and heals allies in a small area of effect. Affected allies briefly receive increased healing from all sources, while enemies caught in the blast cannot be healed for a few moments.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/ana/ability-biotic-grenade/icon-ability.png"
      },
      {
        "name": "Nano Boost",
        "description": "After Ana hits one of her allies with a combat boost, they deal more damage, and take less damage from enemies’ attacks.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/ana/ability-nano-boost/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Ana Amari",
        "age": "60",
        "occupation": "Bounty Hunter",
        "baseOfOperations": "Cairo, Egypt",
        "affiliation": "Overwatch (formerly)"
      },
      "catchPhrase": "Everyone must find their cause.",
      "backStory": "One of the founding members of Overwatch, Ana uses her skills and expertise to defend her home and the people she cares for. As the Omnic Crisis inflicted a heavy toll on Egypt, the country's depleted and undermanned security forces relied on elite snipers for support. Among them was Ana Amari, who was widely considered to be the world's best. Her superior marksmanship, decision-making, and instincts made her a natural selection to join the Overwatch strike team that would end the war. Following the success of Overwatch's original mission, Ana served for many years as Strike Commander Morrison's second-in-command. Despite her responsibilities in leading the organization, Ana refused to step away from combat operations. She remained on active duty well into her fifties, until she was believed to have been killed during a hostage rescue mission by the Talon operative known as Widowmaker. In truth, Ana survived that encounter, despite being gravely wounded and losing her right eye. During her recovery, she wrestled with the weight of a life spent in combat, and she chose to stay out of the world's growing conflicts. However, as time passed, she realized she could not sit on the sidelines while people threatened her city and the innocents around her. Now, Ana has rejoined the fight to protect her country from the forces that would destabilize it, and most importantly, to keep her family and her closest allies safe."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/ana/hero-select-portrait.png"
  },
  "pharah": {
    "name": "Pharah",
    "role": "Damage",
    "difficulty": 1,
    "description": "Soaring through the air in her combat armor, and armed with a launcher that lays down high-explosive rockets, Pharah is a force to be reckoned with.",
    "abilities": [
      {
        "name": "Rocket Launcher",
        "description": "Pharah’s primary weapon launches rockets that deal significant damage in a wide blast radius.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/pharah/ability-rocket-launcher/icon-ability.png"
      },
      {
        "name": "Jump Jet",
        "description": "Propelled by her suit’s thrusters, Pharah soars high into the air.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/pharah/ability-jump-jet/icon-ability.png"
      },
      {
        "name": "Concussive Blast",
        "description": "Pharah looses a wrist rocket that knocks back any enemies it strikes.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/pharah/ability-concussive-blast/icon-ability.png"
      },
      {
        "name": "Barrage",
        "description": "Pharah directs a continuous salvo of mini-rockets to destroy groups of enemies.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/pharah/ability-barrage/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Fareeha Amari",
        "age": "32",
        "occupation": "Security Chief",
        "baseOfOperations": "Giza, Egypt",
        "affiliation": "Helix Security International"
      },
      "catchPhrase": "I will protect the innocent.",
      "backStory": "Fareeha Amari's commitment to duty runs in her blood. She comes from a long line of highly decorated soldiers and burns with the desire to serve with honor. As a child, Fareeha dreamed of following in her mother's footsteps and joining the global peacekeeping force, Overwatch. She enlisted in the Egyptian army, and her dogged persistence and tactical prowess caused her to rise up through the officer ranks. She was a courageous leader and earned the loyalty of all who served under her. With her exemplary record, Fareeha was well placed to join the ranks of Overwatch, but before she had that opportunity, Overwatch was disbanded. After leaving the army with a commendation for distinguished service, she was offered employment with Helix Security International, a private security firm contracted to defend the artificial intelligence research facility beneath the Giza Plateau. The top-secret facility was touted as vital to the safety of not only the region but countries across the globe. Fareeha gladly accepted the choice assignment and received training in the Raptora Mark VI, an experimental combat suit designed for rapid mobility and devastating firepower. Under the call sign \"Pharah,\" she works to safeguard the AI installation. Though she mourns Overwatch's passing, she still dreams of fighting the good fight and making a difference on a global scale."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/pharah/hero-select-portrait.png"
  },
  "roadhog": {
    "name": "Roadhog",
    "role": "Tank",
    "difficulty": 1,
    "description": "Roadhog uses his signature Chain Hook to pull his enemies close before shredding them with blasts from his Scrap Gun. He’s hardy enough to withstand tremendous damage, and can recover his health with a short breather.",
    "abilities": [
      {
        "name": "Scrap Gun",
        "description": "Roadhog's Scrap Gun fires short-range blasts of shrapnel with a wide spread. Alternatively, it can launch a shrapnel ball that detonates farther away, scattering metal fragments from the point of impact.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/roadhog/ability-scrap-gun/icon-ability.png"
      },
      {
        "name": "Take a Breather",
        "description": "Roadhog restores a chunk of his health over a brief period of time.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/roadhog/ability-take-a-breather/icon-ability.png"
      },
      {
        "name": "Chain Hook",
        "description": "Roadhog hurls his chain at a target; if it catches, he yanks them into close range.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/roadhog/ability-chain-hook/icon-ability.png"
      },
      {
        "name": "Whole Hog",
        "description": "After cramming a top-loader onto his Scrap Gun, Roadhog pours in ammo. For a short time, he can crank out a stream of shrapnel that knocks back enemies.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/roadhog/ability-whole-hog/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Mako Rutledge",
        "age": "48",
        "occupation": "Enforcer (formerly), Bodyguard",
        "baseOfOperations": "Junkertown, Australia (formerly)",
        "affiliation": "Junkers (formerly)"
      },
      "catchPhrase": "I'm a one-man apocalypse.",
      "backStory": "Roadhog is a ruthless killer with a well-earned reputation for cruelty and wanton destruction. After the Omnic Crisis, government officials gifted the Australian omnium and the surrounding area to the omnics that had nearly destroyed their country, hoping to establish a long-term peace accord. This arrangement permanently displaced Mako Rutledge and a large number of the Outback's residents, a scattered collection of survivalists, solar farmers, and people who just wanted to be left alone.\n Furious over the loss of their homes, Mako and others turned to violent rebellion. They formed the Australian Liberation Front and struck against the omnium and its robot population to take back the lands that had been stolen. Events continued to escalate until the rebels sabotaged the omnium's fusion core, resulting in an explosion that destroyed the facility, irradiated the region, and littered the Outback with twisted metal and wreckage for kilometers around.\n Mako watched as his home became an apocalyptic wasteland, and he was forever changed. Adapting to his environment, he donned a mask and took to the broken highways of the Outback on his ramshackle chopper. Little by little, his humanity was forgotten. The last vestiges of Mako faded away and the ruthless killer Roadhog was born."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/roadhog/hero-select-portrait.png"
  },
  "zarya": {
    "name": "Zarya",
    "role": "Tank",
    "difficulty": 3,
    "description": "Deploying powerful personal barriers that convert incoming damage into energy for her massive Particle Cannon, Zarya is an invaluable asset on the front lines of any battle.",
    "abilities": [
      {
        "name": "Particle Cannon",
        "description": "Zarya’s mighty Particle Cannon unleashes a short-range beam of destructive energy. Alternatively, Zarya can lob an explosive charge to strike multiple opponents.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/zarya/ability-particle-cannon/icon-ability.png"
      },
      {
        "name": "Particle Barrier",
        "description": "The Particle Cannon can emit a personal barrier that shields Zarya against incoming attacks, redirecting their energy to enhance her weapon’s damage and the width of its beam.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/zarya/ability-particle-barrier/icon-ability.png"
      },
      {
        "name": "Projected Barrier",
        "description": "Zarya surrounds one of her teammates with an energy barrier that simultaneously absorbs fire and boosts the power of her Particle Cannon.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/zarya/ability-projected-barrier/icon-ability.png"
      },
      {
        "name": "Graviton Surge",
        "description": "Zarya launches a gravity bomb that draws in enemy combatants and deals damage while they’re trapped.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/zarya/ability-graviton-surge/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Aleksandra Zaryanova",
        "age": "28",
        "occupation": "Soldier",
        "baseOfOperations": "Krasnoyarsk Front, Russia",
        "affiliation": "Russian Defense Forces"
      },
      "catchPhrase": "Together we are strong.",
      "backStory": "Aleksandra Zaryanova is one of the world's strongest women, a celebrated athlete who sacrificed personal glory to protect her family, friends, and country in a time of war. Aleksandra was born in a remote Siberian village that was on the front lines of the Omnic Crisis, which began some thirty years ago. Although Russian forces defeated the robots and shut down their omnium, the region was devastated by the conflict. Only a child at the time, Aleksandra was surrounded by the post-war destruction, and as she grew older, she swore that she would gain the strength to help her people recover. Focusing on weightlifting and bodybuilding, Aleksandra was identified by the national athletics program as a potential star. She trained extensively, moving up the ranks while representing her country, and was expected to shatter longstanding records in the upcoming world championships. But on the eve of the tournament, an attack came from the long-dormant Siberian omnium, and her village was thrust into war once again. Aleksandra immediately withdrew from the competition and rushed home to enlist in the local defense forces, sacrificing the life of fame and fortune she might have had. Now she serves—a symbol to some, a stalwart fellow soldier to others. But for Aleksandra, it is a chance to use her great strength to protect the ones she loves."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/zarya/hero-select-portrait.png"
  },
  "torbjorn": {
    "name": "Torbjörn",
    "role": "Damage",
    "difficulty": 2,
    "description": "Torbjörn’s extensive arsenal includes a rivet gun, hammer, and a personal forge that he can use to build turrets.",
    "abilities": [
      {
        "name": "Rivet Gun",
        "description": "Torbjörn fires rivets at long range or ejects molten metal from his gun in a short, close-range burst.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/torbjörn/ability-rivet-gun/icon-ability.png"
      },
      {
        "name": "Forge Hammer",
        "description": "This multipurpose hammer repairs turrets and, in a pinch, can also be used as a weapon.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/torbjörn/ability-forge-hammer/icon-ability.png"
      },
      {
        "name": "Deploy Turret",
        "description": "Torbjörn deploys a self-building turret which automatically tracks and attacks enemies.  ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/torbjörn/ability-deploy-turret/icon-ability.png"
      },
      {
        "name": "Overload",
        "description": "Torbjörn gains additional armor as well as improved attack, movement, and reload speed for a brief period.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/torbjörn/ability-overload/icon-ability.png"
      },
      {
        "name": "Molten Core",
        "description": "Torbjörn creates pools of molten slag that deal massive, sustained damage (plus bonus damage to armor), and can prevent enemies from moving through key locations.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/torbjörn/ability-molten-core/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Torbjörn Lindholm",
        "age": "57",
        "occupation": "Weapons Designer",
        "baseOfOperations": "Gothenburg, Sweden",
        "affiliation": "Overwatch (formerly)"
      },
      "catchPhrase": "Build ‘em up, break ‘em down.",
      "backStory": "At its height, Overwatch possessed one of the most advanced armaments on the planet, which could be traced to the workshop of an ingenious engineer named Torbjörn Lindholm. Before the Omnic Crisis, Torbjörn had gained notoriety for designing weapons systems used by countries around the world. However, his belief that technology must serve a better vision for humanity put him at odds with his employers, who desired to control his weapons using networked computer intelligence. Torbjörn had a deep mistrust of sentient robotic intelligence, and while many of his peers wrote this off as paranoia, his worst fears were realized when the robot populations of the world turned against their human creators during the Omnic Crisis. Because of his engineering genius, he was recruited to join the original Overwatch strike team, and his many inventions proved integral to ending the crisis. In the years that followed, Overwatch became an international peacekeeping force, and Torbjörn remained a critical resource for all of its technological needs and signature weapons systems. But in the aftermath of Overwatch's fall, many of Torbjörn's weapons were stolen or stashed away around the world. Feeling responsible for his creations, Torbjörn is determined to stop them from falling into the wrong hands and wreaking havoc on the innocent."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/torbjörn/hero-select-portrait.png"
  },
  "bastion": {
    "name": "Bastion",
    "role": "Damage",
    "difficulty": 1,
    "description": "Repair protocols and the ability to transform between stationary Assault, mobile Recon and devastating Tank configurations provide Bastion with a high probability of victory.",
    "abilities": [
      {
        "name": "Configuration: Recon",
        "description": "In Recon mode, Bastion is fully mobile, outfitted with a submachine gun that fires steady bursts of bullets at medium range.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/bastion/ability-configuration:-recon/icon-ability.png"
      },
      {
        "name": "Configuration: Sentry",
        "description": "In Sentry mode, Bastion is a stationary powerhouse equipped with a gatling gun capable of unleashing a hail of bullets. The gun's aim can be \"walked\" across multiple targets, dealing devastating damage at short to medium range.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/bastion/ability-configuration:-sentry/icon-ability.png"
      },
      {
        "name": "Reconfigure",
        "description": "Bastion transforms between its two primary combat modes to adapt to  battlefield conditions.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/bastion/ability-reconfigure/icon-ability.png"
      },
      {
        "name": "Self-Repair",
        "description": "Bastion restores its health; it cannot fire weapons while the repair process is in effect.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/bastion/ability-self-repair/icon-ability.png"
      },
      {
        "name": "Configuration: Tank",
        "description": "In Tank mode, Bastion extends wheeled treads and a powerful long-range cannon. The cannon’s explosive shells demolish targets in a wide blast radius, but Bastion can only remain in this mode for a limited time.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/bastion/ability-configuration:-tank/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "SST Laboratories Siege Automaton E54",
        "age": "30",
        "occupation": "Battle Automaton",
        "baseOfOperations": "Unknown",
        "affiliation": "None"
      },
      "catchPhrase": "",
      "backStory": "Once a frontline combatant in the devastating Omnic Crisis, this curious Bastion unit now explores the world, fascinated by nature but wary of a fearful humanity. Originally created for peacekeeping purposes, Bastion robot units possessed the unique ability to rapidly reconfigure themselves into an assault-cannon mode. But during the Omnic Crisis, they were turned against their human makers, forming the bulk of the omnics' rebel army. Following the resolution of the crisis, nearly all of them were destroyed or disassembled. To this day, Bastion units still symbolize the horrors of the conflict. One unique Bastion unit, severely damaged in the final battles of the war, was left forgotten for over a decade. It lay dormant, exposed to the elements and rusting while nature slowly reclaimed it. Overgrown with vines and roots and nested upon by small animals, the robot sat inert, seemingly unaware of the passing of time. That was until one fateful day, when it unexpectedly reactivated. With its combat programming all but lost, it instead displayed an intense curiosity about the natural world and its inhabitants. This inquisitive Bastion unit set out to explore its surroundings and discover its purpose on a war-ravaged planet. Though \"Bastion\" appears to be gentle—even harmless, at times—its core combat programming takes over when the unit senses danger, utilizing its entire arsenal to eliminate anything it perceives as a threat. This has led to instances of conflict with the few humans it has encountered, and has driven it to avoid populated areas in favor of the wild, uncharted regions of the world."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/bastion/hero-select-portrait.png"
  },
  "sigma": {
    "name": "Sigma",
    "role": "Tank",
    "difficulty": 3,
    "description": "Sigma is an eccentric astrophysicist and volatile tank who gained the power to control gravity in an orbital experiment gone wrong. Manipulated by Talon and deployed as a living weapon, Sigma’s presence on the battlefield cannot be ignored. ",
    "abilities": [
      {
        "name": "Hyperspheres",
        "description": "Sigma launches two gravitic charges, which bounce off walls and implode after a short duration, damaging enemies within a sizable radius.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/sigma/ability-hyperspheres/icon-ability.png"
      },
      {
        "name": "Experimental Barrier",
        "description": "Sigma propels a floating barrier to a location of his choosing. He can dismiss the barrier at any time.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/sigma/ability-experimental-barrier/icon-ability.png"
      },
      {
        "name": "Kinetic Grasp",
        "description": "Sigma freezes incoming projectiles in midair, converting them into shields.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/sigma/ability-kinetic-grasp/icon-ability.png"
      },
      {
        "name": "Accretion",
        "description": "Sigma gathers a mass of debris and flings it at an enemy to knock them down.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/sigma/ability-accretion/icon-ability.png"
      },
      {
        "name": "Gravitic Flux",
        "description": "Unleashing his full powers, Sigma takes flight, lifts enemies in a targeted area, and launches them into the sky before slamming them back down.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/sigma/ability-gravitic-flux/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Siebren de Kuiper",
        "age": "62",
        "occupation": "Astrophysicist",
        "baseOfOperations": "The Hague, Netherlands (formerly)",
        "affiliation": "Talon"
      },
      "catchPhrase": "There is no obligation for the universe to make sense to you.",
      "backStory": "Brilliant astrophysicist Dr. Siebren de Kuiper's life changed forever when an experiment gone wrong gave him the ability to control gravity; now, Talon manipulates him to their own ends. De Kuiper was considered a pioneer in his field. His life's work involved devising a way to harness the power of gravity. Equally known for his groundbreaking research and eccentric personality, he conducted most of his studies from his lab in The Hague. Believing that he was close to achieving his goal, he performed his most important experiment on an international space station. But something went wrong, triggering the brief formation of a black hole. De Kuiper was only exposed to its power for a moment, but he suffered serious psychological damage. The area around him began to experience strange fluctuations in gravity, peaking and dropping in time with his reactions. He had to be evacuated immediately. Upon returning to Earth, De Kuiper was quarantined in a secret government facility. Between his ravings about the patterns of the universe, the psychic damage he sustained, and the gravitic anomalies happening around him, he was deemed unsafe and detained for years under the name \"Subject Sigma.\" Isolated and unable to control his powers, De Kuiper retreated into his own mind. He thought he would never see the outside world again. When Talon discovered De Kuiper's existence, they infiltrated the facility and broke him out, planning to use his brilliance and research to further their plans. In their custody, De Kuiper slowly gained control of his powers. Now, gravity moved according to his will, and he was closer than ever to achieving his life's goal. But the same experiment that had opened his mind had also fractured it, and he struggled to keep the pieces together. De Kuiper continues to develop his powers in hopes of unlocking the secrets of the universe, unaware that Talon is using both him and his research."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/sigma/hero-select-portrait.png"
  },
  "orisa": {
    "name": "Orisa",
    "role": "Tank",
    "difficulty": 2,
    "description": "Orisa serves as the central anchor of her team, and defends her teammates from the frontline with a protective barrier. She can attack from long range, fortify her own defenses, launch graviton charges to slow and move enemies, and deploy a Supercharger to boost the damage output of multiple allies at once.",
    "abilities": [
      {
        "name": "Fusion Driver ",
        "description": "Orisa’s automatic projectile cannon delivers sustained damage, but slows her movement while she fires it. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/orisa/ability-fusion-driver-/icon-ability.png"
      },
      {
        "name": "Fortify",
        "description": "Orisa temporarily reduces damage she takes, and cannot be affected by action-impairing effects.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/orisa/ability-fortify/icon-ability.png"
      },
      {
        "name": "Halt! ",
        "description": "Orisa launches a graviton charge which she can detonate, slowing nearby enemies and pulling them towards the explosion.  ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/orisa/ability-halt!-/icon-ability.png"
      },
      {
        "name": "Protective Barrier ",
        "description": "Orisa throws out a stationary barrier that can protect her and her allies from enemy fire. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/orisa/ability-protective-barrier-/icon-ability.png"
      },
      {
        "name": "Supercharger ",
        "description": "Orisa deploys a device to increase damage inflicted by allies within her line of sight. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/orisa/ability-supercharger-/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Orisa",
        "age": "1 month",
        "occupation": "Guardian Robot",
        "baseOfOperations": "Numbani",
        "affiliation": "None"
      },
      "catchPhrase": "Your safety is my primary concern.",
      "backStory": "Built from parts of one of Numbani's short-lived OR15 defense robots, Orisa is the city's newest protector, though she still has much to learn. Originally put into service before the Omnic Crisis, the OR14 \"Idina\" line of security robots was built in Nigeria's massive manufacturing omnium. After the war, they were taken out of production, along with many of the other models used during the crisis. Twenty years later, Numbani revived and recommissioned the OR14 program to protect the city from external threats. These new OR15s were deployed for a short time before they were destroyed in an attack by Doomfist. Following the attack, the program was scrapped, and the civic government sold off the remaining OR15 inventory. Some parts were purchased by eleven-year-old Efi Oladele, a brilliant girl whose early accomplishments in robotics and artificial intelligence had already earned her the Adawe Foundation's \"genius grant.\" With the approval of her understanding and open-minded parents, Efi spent the bulk of her grant money to acquire one of the decommissioned OR15 bots. She believed that Numbani needed a protector and that an upgraded OR15 could do just that. Efi repaired and reconfigured the robot and installed a personality core that she had designed herself. She named Numbani's newest hero Orisa. Orisa has shown that she can be of service to the city, but she is still working toward finding her optimal protocols. The omnic's inexperience can cause her to be an occasional liability. Fortunately, between Efi's willingness to make the necessary modifications and Orisa's adaptive artificial intelligence, both robot and creator have always been able to set things right. As Orisa starts her career as a guardian, she has much to learn about the world and her functionality. But as long as she is guided by Efi's boundless optimism and her own growing sense of honor and duty, Orisa stands ready to protect Numbani and her creator at any cost."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/orisa/hero-select-portrait.png"
  },
  "junkrat": {
    "name": "Junkrat",
    "role": "Damage",
    "difficulty": 2,
    "description": "Junkrat’s area-denying armaments include a Frag Launcher that lobs bouncing grenades, Concussion Mines that send enemies flying, and Steel Traps that stop foes dead in their tracks.",
    "abilities": [
      {
        "name": "Frag Launcher",
        "description": "Junkrat's Frag Launcher lobs grenades a significant distance. They bounce to reach their destination, and blow up when they strike an enemy.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/junkrat/ability-frag-launcher/icon-ability.png"
      },
      {
        "name": "Concussion Mine",
        "description": "After placing one of his homemade Concussion Mines, Junkrat can trigger it to damage enemies and send them flying... or propel himself through the air.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/junkrat/ability-concussion-mine/icon-ability.png"
      },
      {
        "name": "Steel Trap",
        "description": "Junkrat tosses out a giant, metal-toothed trap. Should an enemy wander too close to the trap, it clamps on, injuring and immobilizing them.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/junkrat/ability-steel-trap/icon-ability.png"
      },
      {
        "name": "Total Mayhem",
        "description": "Junkrat's deranged sense of humor persists past his death. If killed, he drops several live grenades.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/junkrat/ability-total-mayhem/icon-ability.png"
      },
      {
        "name": "RIP-Tire",
        "description": "Junkrat revs up a motorized tire bomb and sends it rolling across the battlefield, climbing over walls and obstacles. He can remotely detonate the RIP-Tire to deal serious damage to enemies caught in the blast, or just wait for it to explode on its own.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/junkrat/ability-rip-tire/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Jamison Fawkes",
        "age": "25",
        "occupation": "Anarchist, Thief, Demolitionist, Mercenary, Scavenger",
        "baseOfOperations": "Junkertown, Australia (formerly)",
        "affiliation": "Junkers (formerly)"
      },
      "catchPhrase": "It's a perfect day for some mayhem.",
      "backStory": "Junkrat is an explosives-obsessed freak who lives to cause chaos and destruction. The attack on the Australian omnium's fusion core forever altered the landscape of the Outback. After the detonation, the area was transformed into a harsh, irradiated wasteland, littered with debris and the twisted fragments of the ruined facility, and unlivable to most. But there were some who survived. Calling themselves the Junkers, they scavenged the husk of the omnium and formed a lawless, cutthroat society in its shadow. Junkrat was one of them, eking out a living reclaiming metal and components from the ruins. Like many others, he was affected by the lingering radiation. This touch of madness made him ideal for handling dangerous explosives, a love which he turned into an obsession. He came to notoriety when he discovered an extremely valuable secret in the bones of the omnium. Though few knew the nature of what he found, he was nonetheless pursued by bounty hunters, gangs, and opportunists wherever he went, until he made a deal with the Junker enforcer Roadhog, who grudgingly agreed to be his personal bodyguard in exchange for a fifty-fifty share of the spoils. Now, with Roadhog in tow, Junkrat has left the Outback, and embarked upon an international crime spree leaving nothing but havoc and bedlam in his wake."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/junkrat/hero-select-portrait.png"
  },
  "zenyatta": {
    "name": "Zenyatta",
    "role": "Support",
    "difficulty": 3,
    "description": "Zenyatta calls upon orbs of harmony and discord to heal his teammates and weaken his opponents, all while pursuing a transcendent state of immunity to damage.",
    "abilities": [
      {
        "name": "Orb of Destruction",
        "description": "Zenyatta projects his destructive energy orbs either individually, or in a rapid-fire volley after a few seconds spent gathering power.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/zenyatta/ability-orb-of-destruction/icon-ability.png"
      },
      {
        "name": "Orb of Harmony",
        "description": "Zenyatta casts an orb over the shoulder of a targeted ally. So long as Zenyatta maintains line of sight, the orb slowly restores health to his ally. Only one ally can receive the orb's benefit at a time.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/zenyatta/ability-orb-of-harmony/icon-ability.png"
      },
      {
        "name": "Orb of Discord",
        "description": "Attaching the orb of discord to an opponent amplifies the amount of damage they receive for as long as Zenyatta maintains line of sight. Only one opponent can suffer the orb's effects at a time.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/zenyatta/ability-orb-of-discord/icon-ability.png"
      },
      {
        "name": "Transcendence",
        "description": "Zenyatta enters a state of heightened existence for a short period of time. While transcendent, Zenyatta cannot use abilities or weapons, but is immune to damage and automatically restores his health  and that of nearby allies.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/zenyatta/ability-transcendence/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Tekhartha Zenyatta",
        "age": "20",
        "occupation": "Wandering Guru, Adventurer",
        "baseOfOperations": "Shambali Monastery, Nepal (formerly)",
        "affiliation": "The Shambali (formerly)"
      },
      "catchPhrase": "True self is without form.",
      "backStory": "Zenyatta is an omnic monk who wanders the world in search of spiritual enlightenment. It is said that those who cross his path are never the same again. Years ago, following the Omnic Crisis, a group of outcast omnic robots experienced what they described as a spiritual awakening. They abandoned their preprogrammed lives to establish a communal monastery deep in the Himalayas. After many years of meditation on the nature of existence, they came to the belief that they were more than artificial intelligences and that, like humans, they possessed the essence of a soul. Recognizing the spiritual equality they held with humans, the monks, led by the enigmatic robot known as Tekhartha Mondatta, sought to heal the wounds caused by the Omnic Crisis a generation earlier and bring humans and robots back into societal harmony. Their message was embraced by millions around the world, and they became global celebrities. But one monk, Zenyatta, disagreed with this new direction. He believed that the way to repair the problems between humans and omnics was not through dogmatic teaching but through interpersonal connection and engagement. Ultimately, Zenyatta followed his own path. He chose to leave the monastery and wander the world, helping those he meets to overcome their personal struggles and find inner peace. But, when necessary, he will fight to protect the innocent, be they omnic or human."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/zenyatta/hero-select-portrait.png"
  },
  "winston": {
    "name": "Winston",
    "role": "Tank",
    "difficulty": 2,
    "description": "Winston wields  impressive inventions—a jump pack, electricity-blasting Tesla Cannon, portable shield projector and more—with literal gorilla strength.",
    "abilities": [
      {
        "name": "Tesla Cannon",
        "description": "Winston’s weapon fires a short-range electric barrage for as long as he holds down the trigger.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/winston/ability-tesla-cannon/icon-ability.png"
      },
      {
        "name": "Jump Pack",
        "description": "Assisted by his energy pack, Winston lunges through the air, dealing significant damage and staggering nearby enemies when he lands.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/winston/ability-jump-pack/icon-ability.png"
      },
      {
        "name": "Barrier Projector",
        "description": "Winston’s barrier projector extends a bubble-shaped field that absorbs damage until it's destroyed. Allies protected by the barrier can return fire from within it.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/winston/ability-barrier-projector/icon-ability.png"
      },
      {
        "name": "Primal Rage",
        "description": "Winston embraces his animal nature, significantly boosting his health  and making him very difficult to kill, strengthening his melee attack, and allowing him to use his Jump Pack ability more frequently. While raging, Winston can only make melee and Jump Pack attacks.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/winston/ability-primal-rage/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Winston",
        "age": "29",
        "occupation": "Scientist, Adventurer",
        "baseOfOperations": "Horizon Lunar Colony (formerly)",
        "affiliation": "Overwatch (formerly)"
      },
      "catchPhrase": "Imagination is the essence of discovery.",
      "backStory": "A super-intelligent, genetically engineered gorilla, Winston is a brilliant scientist and a champion for humanity's potential. The Horizon Lunar Colony was established as a first step for humanity's renewed exploration of space. Among its residents was a group of genetically enhanced gorillas that were intended to test the effects of prolonged habitation in space. One gorilla displayed such rapid brain development from the gene therapy that he was taken under the wing of Dr. Harold Winston, who taught him science and inspired him with tales of human ingenuity. The young gorilla passed his days assisting with the scientists' experiments, watching the distant blue world outside his habitat window, dreaming of the endless possibilities that awaited him there. But his life was thrown into chaos when the other gorillas led an uprising, killed the mission scientists, and claimed the colony for their own. Taking on the name of his beloved human caretaker, Winston built a makeshift rocket and escaped to Earth. There he found a new home with Overwatch, an organization that represented everything he had come to admire about humanity. Winston was finally able to live up to the heroic ideal that had been instilled in him. Now with the fall of Overwatch, Winston has gone into seclusion, once again cut off from the world he believes in, but longing for the days of heroism to return."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/winston/hero-select-portrait.png"
  },
  "tracer": {
    "name": "Tracer",
    "role": "Damage",
    "difficulty": 2,
    "description": "Toting twin pulse pistols, energy-based time bombs, and rapid-fire banter, Tracer is able to \"blink\" through space and rewind her personal timeline as she battles to right wrongs the world over.",
    "abilities": [
      {
        "name": "Pulse Pistols",
        "description": "Tracer rapid-fires both of her pistols.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/tracer/ability-pulse-pistols/icon-ability.png"
      },
      {
        "name": "Blink",
        "description": "Tracer zips horizontally through space in the direction she’s moving, and reappears several yards away. She stores up to three charges of the blink ability and generates more every few seconds.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/tracer/ability-blink/icon-ability.png"
      },
      {
        "name": "Recall",
        "description": "Tracer bounds backward in time, returning her health, ammo and position on the map to precisely where they were a few seconds before.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/tracer/ability-recall/icon-ability.png"
      },
      {
        "name": "Pulse Bomb",
        "description": "Tracer lobs a large bomb that adheres to any surface or unfortunate opponent it lands on. After a brief delay, the bomb explodes, dealing high damage to all enemies within its blast radius.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/tracer/ability-pulse-bomb/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Lena Oxton",
        "age": "26",
        "occupation": "Adventurer",
        "baseOfOperations": "London, England",
        "affiliation": "Overwatch (formerly)"
      },
      "catchPhrase": "Cheers, love! The cavalry’s here!",
      "backStory": "The former Overwatch agent known as Tracer is a time-jumping adventurer and an irrepressible force for good. Lena Oxton (call sign: \"Tracer\") was the youngest person ever inducted into Overwatch's experimental flight program. Known for her fearless piloting skills, she was handpicked to test the prototype of a teleporting fighter, the Slipstream. But during its first flight, the aircraft's teleportation matrix malfunctioned, and it disappeared. Lena was presumed dead. She reappeared months later, but her ordeal had greatly changed her: her molecules had been desynchronized from the flow of time. Suffering from \"chronal disassociation,\" she was a living ghost, disappearing for hours and days at a time. Even for the brief moments she was present, she was unable to maintain physical form. Overwatch's doctors and scientists were stumped, and Tracer's case seemed hopeless until a scientist named Winston  designed the chronal accelerator, a device capable of keeping Tracer anchored in the present. In addition, it gave Tracer the ability to control her own time, allowing her to speed it up and slow it down at will. With her newfound skills, she became one of Overwatch's most effective agents. Since Overwatch's dissolution, Tracer has continued to right wrongs and fight the good fight wherever the opportunity presents itself."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/tracer/hero-select-portrait.png"
  },
  "sombra": {
    "name": "Sombra",
    "role": "Damage",
    "difficulty": 3,
    "description": "Stealth and debilitating attacks make Sombra a powerful infiltrator. Her hacking can disrupt her enemies, ensuring they're easier to take out, while her EMP provides the upper hand against multiple foes at once. Sombra’s ability to Translocate and camouflage herself makes her a hard target to pin down.",
    "abilities": [
      {
        "name": "Machine Pistol",
        "description": "Sombra’s fully-automatic machine pistol fires in a short-range spread.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/sombra/ability-machine-pistol/icon-ability.png"
      },
      {
        "name": "Hack",
        "description": "Sombra hacks enemies to temporarily stop them from using their abilities, or hacks first aid kits to make them useless to her opponents.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/sombra/ability-hack/icon-ability.png"
      },
      {
        "name": "Stealth",
        "description": "Sombra becomes invisible, during which her speed is boosted considerably. Attacking, using offensive abilities, or taking damage disables her camouflage. Sombra cannot capture objectives while invisible. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/sombra/ability-stealth/icon-ability.png"
      },
      {
        "name": "Translocator",
        "description": "Sombra tosses out a translocator beacon. She can instantly return to the beacon’s location while it is active (including when it’s in mid-flight).",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/sombra/ability-translocator/icon-ability.png"
      },
      {
        "name": "EMP",
        "description": "Sombra discharges electromagnetic energy in a wide radius, destroying enemy barriers and shields and hacking all opponents caught in the blast.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/sombra/ability-emp/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "░░░░░░",
        "age": "30",
        "occupation": "Hacker",
        "baseOfOperations": "Dorado, Mexico",
        "affiliation": "Talon, Los Muertos (formerly)"
      },
      "catchPhrase": "Everything can be hacked… and everyone.",
      "backStory": "One of the world's most notorious hackers, Sombra uses information to manipulate those in power. Long before she took up the alias \"Sombra,\" ░░░░░░ was among the thousands of children who were left orphaned in the aftermath of the Omnic Crisis. With much of her country's infrastructure destroyed, she survived by utilizing her natural gifts with hacking and computers. After ░░░░░░  was taken in by Mexico's Los Muertos gang, she aided it in its self-styled revolution against the government. Los Muertos believed that the rebuilding of Mexico had primarily benefited the rich and the influential, leaving behind those who were most in need of assistance. Following her many conquests, ░░░░░░ was supremely confident in her skills, but she was caught unprepared when she stumbled into the web of a global conspiracy—one that had also noticed her. With her security irreparably compromised, ░░░░░░ was forced to delete all traces of her identity and went into hiding. She later reemerged as Sombra, upgraded and determined to find out the truth behind the conspiracy she had uncovered. Sombra launched an even more audacious string of hacks, and her exploits earned her no shortage of admirers, including Talon. She joined the organization's ranks and is believed to have contributed to its massive cyberattacks against corporations with strong ties to their governments. These efforts incited a popular revolution in Mexico against LumériCo and breached the security of Volskaya Industries, the manufacturing arm of Russia's anti-omnic defense. Now, with Talon's extensive resources to call upon, Sombra can focus on her true goal: to unravel the conspiracy and use the power behind it to her own ends."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/sombra/hero-select-portrait.png"
  },
  "hanzo": {
    "name": "Hanzo",
    "role": "Damage",
    "difficulty": 3,
    "description": "Hanzo’s versatile arrows can reveal his enemies or fragment to strike multiple targets. He can scale walls to fire his bow from on high, or summon a titanic spirit dragon.",
    "abilities": [
      {
        "name": "Storm Bow",
        "description": "Hanzo nocks and fires an arrow at his target.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/hanzo/ability-storm-bow/icon-ability.png"
      },
      {
        "name": "Sonic Arrow",
        "description": "Hanzo launches an arrow that contains a sonar tracking device. Any enemy within its detection radius is visibly marked, making them easier for Hanzo and his allies to hunt down.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/hanzo/ability-sonic-arrow/icon-ability.png"
      },
      {
        "name": "Storm Arrows",
        "description": "Hanzo’s next several arrows fire instantly, but at reduced damage.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/hanzo/ability-storm-arrows/icon-ability.png"
      },
      {
        "name": "Lunge",
        "description": "Hanzo can double jump, allowing him to change direction mid-jump.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/hanzo/ability-lunge/icon-ability.png"
      },
      {
        "name": "Dragonstrike",
        "description": "Hanzo summons a Spirit Dragon which travels through the air in a line. It passes through walls in its way,  devouring any enemies it encounters.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/hanzo/ability-dragonstrike/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Hanzo Shimada",
        "age": "38",
        "occupation": "Mercenary, Assassin",
        "baseOfOperations": "Hanamura, Japan (formerly)",
        "affiliation": "Shimada Clan"
      },
      "catchPhrase": "With every death comes honor. With honor, redemption.",
      "backStory": "Mastering his skills as a bowman and an assassin, Hanzo Shimada strives to prove himself as a warrior without peer. The Shimada family was established centuries ago, a clan of assassins whose power grew over the years, enabling them to build a vast criminal empire that profited from lucrative trade in arms and illegal substances. As the eldest son of the family's head, Hanzo was bound by duty to succeed his father and rule the Shimada empire. From a young age, he was trained for that responsibility, displaying a natural aptitude for leadership and possessing an innate understanding of strategy and tactics. He also excelled in more practical areas: he was a prodigy in martial arts, swordplay, and bowmanship. Upon the death of his father, the clan elders instructed Hanzo to straighten out his wayward younger brother so that he, too, might help rule the Shimada empire. When his brother refused, Hanzo was forced to kill him. This act broke Hanzo's heart and drove him to reject his father's legacy, ultimately leading him to abandon the clan and all that he had worked so hard to attain. Now, Hanzo travels the world, perfecting his skills as a warrior, attempting to restore his honor and put the ghosts of his past to rest."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/hanzo/hero-select-portrait.png"
  },
  "doomfist": {
    "name": "Doomfist",
    "role": "Damage",
    "difficulty": 3,
    "description": "Doomfist’s cybernetics make him a highly-mobile, powerful frontline fighter. In addition to dealing ranged damage with his Hand Cannon, Doomfist can slam the ground, knock enemies into the air and off balance, or charge into the fray with his Rocket Punch. When facing a tightly packed group, Doomfist leaps out of view, then crashes down to earth with a spectacular Meteor Strike.",
    "abilities": [
      {
        "name": "Hand Cannon",
        "description": "Doomfist fires a short-range burst from the knuckles of his fist. Its ammunition is automatically regenerated over a short time.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/doomfist/ability-hand-cannon/icon-ability.png"
      },
      {
        "name": "Seismic Slam",
        "description": "Doomfist leaps forward and smashes into the ground, knocking nearby enemies toward him. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/doomfist/ability-seismic-slam/icon-ability.png"
      },
      {
        "name": "Rising Uppercut",
        "description": "Doomfist uppercuts enemies in front of him into the air.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/doomfist/ability-rising-uppercut/icon-ability.png"
      },
      {
        "name": "Rocket Punch ",
        "description": "After charging up, Doomfist lunges forward and knocks an enemy back, dealing additional damage if they impact a wall.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/doomfist/ability-rocket-punch-/icon-ability.png"
      },
      {
        "name": "Meteor Strike",
        "description": "Doomfist leaps into the sky, then crashes to the ground, dealing significant damage. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/doomfist/ability-meteor-strike/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Akande Ogundimu",
        "age": "45",
        "occupation": "Mercenary",
        "baseOfOperations": "Oyo, Nigeria",
        "affiliation": "Talon"
      },
      "catchPhrase": "Only through conflict do we evolve.",
      "backStory": "Recently freed from imprisonment, Doomfist is determined to plunge the world into a new conflict that he believes will make humanity stronger. Akande Ogundimu was born into a well-regarded Nigerian family, heir to its prosthetic-technology company. A highly intelligent and charismatic figure, Ogundimu helped to expand his family's business and position it for the future while dedicating his free time to his first love: competitive martial arts. He trained in traditional African fighting styles, including Dambe and Gidigbo, as well as in wrestling and other modern combat systems, incorporating the most effective techniques into his repertoire. Ogundimu competed in tournaments all over the continent, utilizing his intuition and ability to read opponents alongside his tremendous speed and strength. But when he lost his right arm in the aftermath of the Omnic Crisis, it seemed his martial arts career was finished before he had reached his prime. His company's cybernetic prosthetics allowed him to recover from his injuries, even making him stronger, but these enhancements rendered him ineligible for competition. He tried to devote himself to his business with the same zeal that he had for fighting, but he found nothing that could fill the void… until he was given a new opportunity by Akinjide Adeyemi, better known to the world as the second Doomfist, the Scourge of Numbani.  Adeyemi offered Ogundimu the chance to fight with him as a mercenary. Initially wary, Ogundimu accepted, and discovered that he now had an arena in which he could unleash his enhanced capabilities. Eventually, Adeyemi brought him into the Talon organization. Talon's belief that humanity would be made stronger through conflict resonated with Ogundimu's personal experiences. Moreover, Talon's power struggles presented a new challenge that allowed him to use his talent in the boardroom along with his cunning as a combatant.  Adeyemi was a useful asset to Talon, but the organization saw far greater potential in Ogundimu, with his intelligence and his ability to inspire as a commander. While Adeyemi was content to profit from raids on Numbani, Ogundimu had a grander vision. This difference in aspiration would lead Ogundimu to kill his teacher and take on the mantle of Doomfist, along with the eponymous gauntlet. As the new Doomfist, Ogundimu rose high in Talon and helped to orchestrate a conflict that the organization hoped would someday engulf the world. However, before their plan came to fruition, Ogundimu was defeated and captured by an Overwatch strike team that included Tracer, Winston, and Genji. He was imprisoned in a maximum-security facility for years, where he waited patiently for events he had incited to play out.  Finally, he sensed that the time had come for him to return. He broke out of his prison and recovered Doomfist's gauntlet in a one-sided battle with Numbani's newly unveiled OR15 defense robots. Now, he has retaken his place in Talon's inner council, ready to spark a war that will consume the world once again."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/doomfist/hero-select-portrait.png"
  },
  "wrecking-ball": {
    "name": "Wrecking Ball",
    "role": "Tank",
    "difficulty": 3,
    "description": "Wrecking Ball rolls across the battlefield, using his arsenal of weapons and his mech’s powerful body to crush his enemies.",
    "abilities": [
      {
        "name": "Quad Cannons",
        "description": "Wrecking Ball’s automatic assault cannons tear apart threats at medium range.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/wrecking-ball/ability-quad-cannons/icon-ability.png"
      },
      {
        "name": "Roll",
        "description": "Wrecking Ball transforms into a ball, increasing his maximum movement speed.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/wrecking-ball/ability-roll/icon-ability.png"
      },
      {
        "name": "Grappling Claw",
        "description": "Wrecking Ball launches a grappling claw, enabling him to anchor to an area and swing from it. If he strikes an enemy with a powered-up swing, they’re damaged and knocked back.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/wrecking-ball/ability-grappling-claw/icon-ability.png"
      },
      {
        "name": "Adaptive Shield",
        "description": "Wrecking Ball’s temporary personal shields absorb damage, providing stronger defenses if more opponents are nearby.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/wrecking-ball/ability-adaptive-shield/icon-ability.png"
      },
      {
        "name": "Piledriver",
        "description": "Wrecking Ball slams onto the ground below, damaging enemies and launching them upward.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/wrecking-ball/ability-piledriver/icon-ability.png"
      },
      {
        "name": "Minefield",
        "description": "Wrecking Ball deploys a field of long-lasting proximity mines which explode on contact with enemies. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/wrecking-ball/ability-minefield/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Hammond",
        "age": "14",
        "occupation": "Mech Pilot, Mechanic",
        "baseOfOperations": "Horizon Lunar Colony (formerly), Junkertown (formerly)",
        "affiliation": "None"
      },
      "catchPhrase": "Do not anger the hamster.",
      "backStory": "In one of the many experiments carried out at Horizon Lunar Colony, animals were given genetic therapy to assess their adaptation to extended periods of habitation on the moon. As an unexpected side effect, several of them exhibited exceptional growth in physical size and brain function. While most of the test subjects were gorillas or other primates, there were some exceptions, including a hamster named Hammond. Like the others, Hammond's intelligence grew, and he became more curious about the world around him. Much to the puzzlement and amusement of the scientists, Hammond would frequently escape into different parts of the moon base. Though they'd always find him and return him to his cell, they never figured out the true purpose behind his nightly escapades. What they didn't know was that Hammond was busy teaching himself the skills of a mechanic, which would soon come in handy. The colony was eventually thrown into chaos when some of the gorillas rose up against the human scientists and took control. Not all of the animals participated, however, and one of the gorillas, Winston, was making a plan to escape to earth. Hammond sensed his opportunity. He built a makeshift capsule and secretly hitched it to Winston's craft as the gorilla blasted off. As the two entered earth's atmosphere, Hammond broke off and landed in a different location: the wasteland of the Australian Outback. Hammond modified his escape pod to enter the lucrative mech battle arena of the Scrapyard. Working his way up the ranks, \"Wrecking Ball\" went from contender to champion, though the pilot's identity remained a mystery to all. Gathering his winnings, Hammond was able to upgrade his mech enough to survive the dangerous trek out of the Junker-controlled Outback. Now free to travel and do as he pleases, Hammond is exploring the world and finding new adventures along the way."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/wrecking-ball/hero-select-portrait.png"
  },
  "widowmaker": {
    "name": "Widowmaker",
    "role": "Damage",
    "difficulty": 2,
    "description": "Widowmaker equips herself with whatever it takes to eliminate her targets, including mines that dispense poisonous gas, a visor that grants her squad infra-sight, and a powerful sniper rifle that can fire in fully-automatic mode.",
    "abilities": [
      {
        "name": "Widow’s Kiss",
        "description": "Widowmaker’s versatile sniper rifle is ideal for scope-aimed shots at distant targets. Should targets close to medium range, the rifle can also be fired in fully-automatic mode.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/widowmaker/ability-widow’s-kiss/icon-ability.png"
      },
      {
        "name": "Grappling Hook",
        "description": "Widowmaker launches a grappling hook towards the location she’s aiming at – when the hook connects with a scalable surface, she’s quickly drawn towards it, allowing her to expand her view of the battlefield and evade or flank targets.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/widowmaker/ability-grappling-hook/icon-ability.png"
      },
      {
        "name": "Venom Mine",
        "description": "Widowmaker adheres a swiftly-arming venom mine to nearly any surface. When a target wanders within range of the mine’s motion trigger, it explodes, delivering  poison gas to any enemies in the vicinity.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/widowmaker/ability-venom-mine/icon-ability.png"
      },
      {
        "name": "Infra-sight",
        "description": "Widowmaker’s recon visor allows her to see the heat signatures of her targets through walls and objects for a moderate amount of time. This enhanced vision is shared with her allies.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/widowmaker/ability-infra-sight/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Amélie Lacroix",
        "age": "33",
        "occupation": "Assassin",
        "baseOfOperations": "Annecy, France",
        "affiliation": "Talon"
      },
      "catchPhrase": "One shot, one kill.",
      "backStory": "Widowmaker is the perfect assassin: a patient, ruthlessly efficient killer who shows neither emotion nor remorse. It is believed that in her former life, Widowmaker was married to Gérard Lacroix, an Overwatch agent spearheading operations against the Talon terrorist organization. After several unsuccessful attempts to eliminate Gérard, Talon decided to change its focus to his wife, Amélie. Talon operatives kidnapped her and subjected her to an intense program of neural reconditioning. They broke her will, suppressed her personality, and reprogrammed her as a sleeper agent. She was eventually found by Overwatch agents, apparently none the worse for wear, and returned to her normal life. Two weeks later she killed Gérard in his sleep. Her mission complete, Amélie returned to Talon, and they completed the process of turning her into a living weapon. She was given extensive training in the covert arts, and then her physiology was altered, drastically slowing her heart, which turned her skin cold and blue and numbed her ability to experience human emotion. Amélie was gone. Now, Widowmaker is Talon's most effective assassin, feeling little save the satisfaction of a job well done."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/widowmaker/hero-select-portrait.png"
  },
  "baptiste": {
    "name": "Baptiste",
    "role": "Support",
    "difficulty": 3,
    "description": "Baptiste wields an assortment of experimental devices and weaponry to keep allies alive and eliminate threats under fierce conditions. A battle-hardened combat medic, he is just as capable of saving lives as he is taking out the enemy.",
    "abilities": [
      {
        "name": "Biotic Launcher",
        "description": "Baptiste’s three-round-burst Biotic Launcher rewards accuracy and recoil control with significant damage output. It also doubles as a healing device, lobbing projectiles that heal allies near the point of impact.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/baptiste/ability-biotic-launcher/icon-ability.png"
      },
      {
        "name": "Regenerative Burst",
        "description": "Baptiste activates an intense regenerative burst that heals himself and nearby allies over time.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/baptiste/ability-regenerative-burst/icon-ability.png"
      },
      {
        "name": "Immortality Field",
        "description": "Baptiste uses a device to create a field that prevents allies from dying. The generator can be destroyed.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/baptiste/ability-immortality-field/icon-ability.png"
      },
      {
        "name": "Amplification Matrix",
        "description": "Baptiste creates a matrix that doubles the damage and healing effects of friendly projectiles that pass through it.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/baptiste/ability-amplification-matrix/icon-ability.png"
      },
      {
        "name": "Exo Boots",
        "description": "By first crouching, Baptiste can jump higher.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/baptiste/ability-exo-boots/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Jean-Baptiste Augustin",
        "age": "36",
        "occupation": "Combat Medic",
        "baseOfOperations": "Tortuga, Haiti (formerly)",
        "affiliation": "Caribbean Coalition (formerly), Talon (formerly)"
      },
      "catchPhrase": "No dying on my watch.",
      "backStory": "An elite combat medic and ex-Talon operative, Baptiste now uses his skills to help those whose lives have been impacted by war. Jean-Baptiste Augustin was one of the 30 million children orphaned by the Omnic Crisis. With limited opportunities and resources, he enlisted in the military. The Caribbean Coalition, a pan-island force formed in response to the Crisis, became his new home. Guided by his innate desire to help people, Baptiste chose the path of a combat medic and served in an elite branch of the Caribbean Coalition’s special ops. After his service was complete, Baptiste struggled to find a demand for his unique skills. He turned to one of the few opportunities open to him: joining the Talon mercenary group, one of the many organizations that were poised to profit off the chaos in the war's aftermath. For the first time ever, Baptiste had a taste of the good life. Talon's missions were easy and paid well, and he put aside some of his earnings to set up a clinic in his hometown. But slowly, his unit's orders escalated in brutality, expanding into assassinations and operations with civilian casualties. Confronted by his team's actions, Baptiste realized he was perpetuating a cycle of violence like the one that had destroyed his own community. He abandoned Talon, disgusted with what he had done and determined to forge a new path for himself. But Talon would not let him go. Baptiste knew too much, and they sent operatives after him to silence him. Agent after agent came for him, including Baptiste's former comrades. To stay under the radar, Baptiste drifted from place to place, aiding in humanitarian efforts around the globe. The few Talon members who managed to track him down were never seen again. Now, Baptiste works toward a better world, healing where he can and fighting when he must. He knows that he cannot undo his past—but that making a difference now is what matters."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/baptiste/hero-select-portrait.png"
  },
  "mercy": {
    "name": "Mercy",
    "role": "Support",
    "difficulty": 1,
    "description": "Mercy’s Valkyrie Suit helps keep her close to teammates like a guardian angel; healing, resurrecting or strengthening them with the beams emanating from her Caduceus Staff.",
    "abilities": [
      {
        "name": "Caduceus Staff",
        "description": "Mercy engages one of two beams that connect to an ally. By maintaining the beams, she can either restore that ally’s health or increase the amount of damage they deal.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mercy/ability-caduceus-staff/icon-ability.png"
      },
      {
        "name": "Caduceus Blaster",
        "description": "Mercy shoots a round from her sidearm. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mercy/ability-caduceus-blaster/icon-ability.png"
      },
      {
        "name": "Guardian Angel",
        "description": "Mercy flies towards a targeted ally, allowing her to reach them quickly and provide assistance in crucial moments.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mercy/ability-guardian-angel/icon-ability.png"
      },
      {
        "name": "Resurrect",
        "description": "Mercy brings a dead ally back into the fight with full health. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mercy/ability-resurrect/icon-ability.png"
      },
      {
        "name": "Angelic Descent",
        "description": "Propelled by her Valkyrie suit, Mercy slows the speed of her descent  from great heights.",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mercy/ability-angelic-descent/icon-ability.png"
      },
      {
        "name": "Valkyrie",
        "description": "Gain the ability to fly. Mercy’s abilities are enhanced. ",
        "icon": "https://d1u1mce87gyfbn.cloudfront.net/hero/mercy/ability-valkyrie/icon-ability.png"
      }
    ],
    "story": {
      "biography": {
        "realName": "Angela Ziegler",
        "age": "37",
        "occupation": "Field Medic, First Responder",
        "baseOfOperations": "Zürich, Switzerland",
        "affiliation": "Overwatch (formerly)"
      },
      "catchPhrase": "Heroes never die.",
      "backStory": "A guardian angel to those who come under her care, Dr. Angela Ziegler is a peerless healer, a brilliant scientist, and a staunch advocate for peace. Ziegler rose to become the head of surgery at a prominent Swiss hospital before pioneering a breakthrough in the field of applied nanobiology that radically improved the treatment of life-threatening illnesses and injuries. It was this expertise that attracted the attention of Overwatch. Because her parents had been taken by war, Ziegler was opposed to the organization's militaristic approach to keeping global peace. Ultimately, she recognized that Overwatch offered her the opportunity to save lives on a much larger scale. As Overwatch's head of medical research, Angela sought to leverage her work for healing in frontline crises. The result was the Valkyrie swift-response suit, which Ziegler herself piloted on many Overwatch missions. Despite her contributions to Overwatch, she was often at odds with her superiors and the organization's overarching aims. When Overwatch dissolved, Ziegler dedicated herself to helping those affected by war. Though she spends most of her time caring for the broken and dispossessed in crisis areas around the world, Dr. Ziegler can be counted on to don her Valkyrie suit whenever innocents are imperiled."
    },
    "portraitUrl": "https://d1u1mce87gyfbn.cloudfront.net/hero/mercy/hero-select-portrait.png"
  }
}